WS-I/BP1.2/Messages/BaseDataTypes/XmlFormatter/RpcLit/SoapWsdl.BaseDataTypes.XmlFormatter.RpcLit_RetDouble_Client_Request-13.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IBaseDataTypesRpcLit/RetDouble</a:Action>
    <a:MessageID>urn:uuid:59852103-49c9-4332-ba65-7e26e67f737c</a:MessageID>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body>
    <RetDouble xmlns="http://tempuri.org/">
      <inDouble xmlns="">-1.4142135623730952</inDouble>
    </RetDouble>
  </s:Body>
</s:Envelope>